interface Project {
  title: string
  description: string
  href?: string
  imgSrc?: string
}

const projectsData: Project[] = [
  {
    title: 'هوش مصنوعی، مدل های زبانی و Spring Ai',
    description:
      'در این دسته، مقالاتی مرتبط با مفاهیم پیشرفته هوش مصنوعی، مدل‌های زبانی بزرگ (LLMs)، و ابزارها و تکنولوژی‌های مدرن مانند Spring AI ارائه شده است. این مطالب به بررسی نحوه پیاده‌سازی هوش مصنوعی در پروژه‌های واقعی، استفاده از مدل‌های زبانی برای تحلیل داده‌ها و ساخت چت‌بات‌ها، و همچنین کاربردهای عملی Spring AI در توسعه نرم‌افزار می‌پردازد. اگر به یادگیری یا اجرای پروژه‌های هوش مصنوعی علاقه‌مند هستید، این دسته‌بندی نقطه شروعی مناسب برای شماست.',
    imgSrc: '/static/images/spring/ai.png',
    href: '/tags/spring-ai',
  },
  {
    title: 'زبان برنامه‌نویسی جاوااسکریپت و React.js',
    description:
      'این دسته به بررسی عمیق زبان جاوااسکریپت و فریم‌ورک محبوب React.js می‌پردازد. مقالات این بخش شامل آموزش‌ها، نکات پیشرفته، و بهترین شیوه‌ها برای توسعه رابط‌های کاربری مدرن و بهینه هستند. همچنین به موضوعاتی مانند مدیریت وضعیت، کامپوننت‌ها، هوک‌ها، و تعامل با APIها پرداخته می‌شود. اگر علاقه‌مند به یادگیری جاوااسکریپت یا بهبود مهارت‌های خود در توسعه با React.js هستید، این دسته‌بندی برای شما مناسب است.',
    imgSrc: '/static/images/react/reactjs.png',
    href: '/tags/react',
  },
  {
    title: 'فریم‌ورک Spring',
    description: `این دسته به معرفی و بررسی جامع فریم‌ورک قدرتمند Spring اختصاص دارد که یکی از پرکاربردترین ابزارها در توسعه برنامه‌های جاوا به شمار می‌رود. مطالب این بخش شامل موضوعاتی مانند Spring Boot، Spring MVC، Spring Data، و Spring Security است. همچنین به نحوه ساخت برنامه‌های ماژولار، امن، و مقیاس‌پذیر با استفاده از قابلیت‌های این فریم‌ورک پرداخته می‌شود. اگر به توسعه نرم‌افزارهای حرفه‌ای با جاوا علاقه‌مند هستید، مقالات این دسته به شما کمک می‌کند تا دانش و مهارت‌های خود را گسترش دهید.`,
    imgSrc: '/static/images/spring/spring.png',
    href: '/tags/%D8%A7%D8%B3%D9%BE%D8%B1%DB%8C%D9%86%DA%AF',
  },
  {
    title: 'زبان برنامه‌نویسی جاوا',
    description:
      'این دسته به یکی از محبوب‌ترین و قدرتمندترین زبان‌های برنامه‌نویسی، یعنی جاوا، اختصاص دارد. در این بخش مقالاتی مرتبط با مفاهیم اساسی جاوا، شیءگرایی، مدیریت حافظه، توسعه برنامه‌های دسکتاپ، وب و موبایل با جاوا ارائه شده است. همچنین موضوعاتی مانند جاوا 23، الگوهای طراحی، و بهینه‌سازی کد نیز پوشش داده می‌شوند. اگر علاقه‌مند به یادگیری جاوا یا ارتقای مهارت‌های خود در این زبان هستید، این دسته‌بندی برای شما مناسب خواهد بود.',
    imgSrc: '/static/images/java/java.png',
    href: '/tags/%D8%AC%D8%A7%D9%88%D8%A7',
  },
  {
    title: 'System Design و معماری نرم‌افزار',
    description:
      'این دسته به اصول، الگوها و روش‌های طراحی سیستم‌ها و معماری نرم‌افزار اختصاص دارد. در این بخش، مفاهیمی مانند طراحی مقیاس‌پذیر، توزیع‌شده و امن، استفاده از الگوهای معماری مانند Microservices و Monolith، و ابزارها و تکنولوژی‌های موردنیاز برای طراحی و پیاده‌سازی سیستم‌های پیچیده بررسی می‌شوند. همچنین موضوعاتی مانند مدیریت بار، طراحی APIها، و بهترین شیوه‌های طراحی برای بهبود عملکرد و قابلیت نگهداری نرم‌افزار پوشش داده شده است. اگر به طراحی سیستم‌های پیشرفته و معماری نرم‌افزار علاقه‌مند هستید، این دسته‌بندی شما را به سطح بالاتری از مهارت می‌رساند.',
    imgSrc: '/static/images/architecture/system-design.png',
    // href: '/tags/%D8%AC%D8%A7%D9%88%D8%A7',
  },
  {
    title: 'DevOps',
    description:
      'این دسته به موضوعات مرتبط با فرهنگ و روش‌های DevOps اختصاص دارد که هدف آن‌ها بهبود همکاری بین تیم‌های توسعه و عملیات است. مقالات این بخش به بررسی ابزارهای پرکاربردی مانند Docker، Kubernetes،  ، و CI/CD پرداخته و نحوه خودکارسازی فرآیندها، مدیریت زیرساخت‌ها، و بهبود سرعت و کیفیت تحویل نرم‌افزار را توضیح می‌دهند. همچنین به مفاهیم مرتبط با نظارت، لاگ‌گیری، و مدیریت منابع در محیط‌های ابری اشاره شده است. اگر می‌خواهید مهارت‌های خود را در زمینه DevOps گسترش دهید، این دسته‌بندی بهترین انتخاب برای شماست.',
    imgSrc: '/static/images/devops/devops.png',
    // href: '/tags/%D8%AC%D8%A7%D9%88%D8%A7',
  },
  {
    title:
      'مهارت‌های نرم، نکات مدیریتی و مسائل متفرقه (Soft Skills, Management Tips & Miscellaneous Topics)',
    description:
      'این دسته طیفی گسترده از موضوعات را پوشش می‌دهد، از مهارت‌های نرم ضروری مانند ارتباط مؤثر، مدیریت زمان، و کار تیمی گرفته تا نکات مدیریتی مانند برنامه‌ریزی استراتژیک، تصمیم‌گیری و مدیریت افراد. علاوه بر این، موضوعات متفرقه‌ای مانند الهام‌بخشی، توسعه شخصی، و چالش‌های رایج در محیط کار نیز در این بخش بررسی می‌شوند. این دسته‌بندی برای افرادی که به دنبال تقویت توانایی‌های خود در جنبه‌های مختلف زندگی حرفه‌ای و فردی هستند، منبعی الهام‌بخش و کاربردی خواهد بود.',
    imgSrc: '/static/images/misc/misc.png',
    href: '/tags/%DA%A9%D8%B3%D8%A8-%D9%88-%DA%A9%D8%A7%D8%B1',
  },
]

export default projectsData
